// 1.	Вывести квадрат числа.

Console.WriteLine("Введите число: ");
string number = Console.ReadLine();
int num = int.Parse(number);
int result = num * num;
Console.WriteLine(result);


